
Перем СчастливоеЧисло;    

Процедура УсловныйОператор()
	Если СчастливоеЧисло >= 6 Тогда
		Сообщить("Првильно");  
	Иначе
		Сообщить("НЕ ПАВИЛЬНО");
	КонецЕсли;
	
КонецПроцедуры 

Функция КвадратЧисел(ЗначениеПервое, ЗначениеВторое)
	СуммаКвадратов = 0;
	Для Счетчик = ЗначениеПервое По ЗначениеВторое Цикл
		Сообщить(Счетчик);
		Сообщить(Счетчик * Счетчик);
		СуммаКвадратов = СуммаКвадратов + Счетчик * Счетчик 
	КонецЦикла;  
	Возврат СуммаКвадратов;
КонецФункции

   
СчастливоеЧисло = 6;
УсловныйОператор();    


	


//Если СчастливоеЧисло >= 6 Тогда
//	      Сообщить("Првильно");  
//Иначе
//	      Сообщить("НЕ ПАВИЛЬНО");
//КонецЕсли;

//ИскомоеЧисло = 1;
//Пока ИскомоеЧисло * ИскомоеЧисло < 30000 Цикл
//	ИскомоеЧисло = ИскомоеЧисло + 1;
//КонецЦикла; 
//Сообщить(ИскомоеЧисло - 1 );

	